Revit 2027 API
RebarConstrainedHandle.Move Method
 Moves the handle with the specified vector.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Move(
	XYZ translation
)
Public Sub Move (
	translation As XYZ
)
public:
void Move(
	XYZ^ translation
)
member Move :
        translation : XYZ -> unit
Parameters
translation XYZ
 The translation vector that will be applied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle cannot be dragged.
Remarks
 This function applies for all handles of a shape driven rebar. This function applies only for handles of a free form rebar that are draggable in canvas (they have drag controls while editing constraints).
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace